package mayton.lucene;

import org.apache.lucene.analysis.StopwordAnalyzerBase;

import java.util.HashMap;
import java.util.Map;

public class UkrainianAnalyzer extends StopwordAnalyzerBase {

    public final static String DEFAULT_STOPWORD_FILE = "ukrainian_stop.txt";

    static final String[] wordEnds = {"а", "ам", "ами", "ах", "та" +
            "в", "вав", "вавсь", "вався", "вала", "валась", "валася", "вали", "вались", "валися", "вало", "валось",
            "валося", "вати", "ватись", "ватися", "всь", "вся", "е", "еві", "ем", "ею", "є", "ємо", "ємось",
            "ємося", "ється", "єте", "єтесь", "єтеся", "єш", "єшся", "єю", "и", "ив", "ий", "ила", "или", "ило",
            "илося", "им", "ими", "имо", "имось", "имося", "ите", "итесь", "итеся", "ити", "ить",
            "иться", "их", "иш", "ишся", "й", "ймо", "ймось", "ймося", "йсь", "йся", "йте", "йтесь", "йтеся",
            "і", "ів", "ій", "ім", "імо", "ість", "істю", "іть", "ї", "ла", "лась", "лася", "ло", "лось", "лося",
            "ли", "лись", "лися", "о", "ові", "овував", "овувала", "овувати", "ого", "ої", "ок", "ом", "ому", "осте",
            "ості", "очка", "очкам", "очками", "очках", "очки", "очків", "очкові", "очком", "очку", "очок", "ою",
            "ти", "тись", "тися", "у", "ував", "увала", "увати", "ь", "ці", "ю", "юст", "юсь", "юся", "ють", "ються",
            "я", "ям", "ями", "ях"
    };

    static final String[] stableExclusions = { "баядер","беатріче","віче","наче","неначе","одначе","паче" };


    static Map<String,String> exclusions = new HashMap() {{
        put("відер" , "відр");
        put("був" , "бува");
    }};

    static Map<String,String> nagolos = new HashMap() {{
        put("а́" , "а");
        put("е́" , "е");
        put("є́" , "є");
        put("и́" , "и");
        put("і́" , "і");
        put("ї́" , "ї");
        put("о́" , "о");
        put("у́" , "у");
        put("ю́" , "ю");
        put("я́" , "я");
    }};
        
    static Map<String,String> changeEndings = new HashMap() {{
                put("аче","ак");
                put("іче","ік");
                put("йовував" ,"йов");
                put("йовувала" ,"йов");
                put("йовувати" ,"йов");
                put("ьовував" ,"ьов");
                put("ьовувала" ,"ьов");
                put("ьовувати" ,"ьов");
                put("цьовував" ,"ц");
                put("цьовувала" ,"ц");
                put("цьовувати" ,"ц");
                put("ядер" ,"ядр");
    }};

    @Override
    protected TokenStreamComponents createComponents(String fieldName) {
        return null;
    }
}
